In [1]:
import pandas as pd

In [2]:
Health_file = pd.read_csv("HEALTH_STAT_17072021163319835.csv")
pop_file = pd.read_csv("HISTPOP_17072021165851274.csv")

health_df = pd.DataFrame(Health_file)
pop_df = pd.DataFrame(pop_file)

In [3]:
pop_df.head()

,LOCATION,Country,SEX,Sex,AGE,Age,TIME,Time,Value,Flag Codes,Flags
0,AUS,Australia,W,Women,TOTAL,Total,1964,1964,5516400.0,NaN,NaN
1,AUS,Australia,W,Women,TOTAL,Total,1965,1965,5626400.0,NaN,NaN
2,AUS,Australia,W,Women,TOTAL,Total,1966,1966,5757910.0,NaN,NaN
3,AUS,Australia,W,Women,TOTAL,Total,1967,1967,5859757.0,NaN,NaN
4,AUS,Australia,W,Women,TOTAL,Total,1968,1968,5965400.0,NaN,NaN

In [4]:
health_df["Variable"].values

array(['Females at birth', 'Females at birth', 'Females at birth', ...,
       'Males at age 80', 'Males at age 80', 'Males at age 80'],
      dtype=object)

In [5]:
pop_df_total = pop_df[pop_df["SEX"] == "T"]
pop_df_clean = pop_df_total.drop(["SEX", "Sex", "AGE", "Age", "TIME", "Flag Codes", "Flags"], axis=1)
population_df = pop_df_clean.rename(columns={"Time":"Year", "Value": "Population"})
population_df.head()

    LOCATION    Country  Year  Population
110      AUS  Australia  1964  11121600.0
111      AUS  Australia  1965  11340900.0
112      AUS  Australia  1966  11599498.0
113      AUS  Australia  1967  11799078.0
114      AUS  Australia  1968  12008635.0

In [6]:
health_df_total = health_df[health_df["Variable"] == "Total population at birth"]
health_df_total_cl = health_df_total.drop(["Variable", "VAR", "UNIT", "Measure", "YEA", "Flag Codes", "Flags"], axis=1)
health_stats = health_df_total_cl.rename(columns={"Value":"Life Expectancy at Birth"})
health_stats.head()

     COU    Country  Year  Life Expectancy at Birth
560  AUS  Australia  1964                      70.7
561  AUS  Australia  1965                      71.0
562  AUS  Australia  1966                      70.8
563  AUS  Australia  1967                      71.2
564  AUS  Australia  1968                      70.9

In [7]:
pop_life = pd.merge(health_stats, population_df, how="right", on=["Country", "Year"])

In [8]:
pop_life = pop_life.drop("LOCATION", axis=1)

In [9]:
pop_life_cl = pop_life.drop_duplicates(subset=["Year","Country"])

In [11]:
pop_life_cl.to_csv(r'health_pop.csv', index = False)

In [18]:
pop_life_fill = pop_life_cl.fillna(pop_life_cl.groupby('Country').transform('mean'))
pop_life_fill_2 = pop_life_cl.fillna(pop_life_cl.groupby('Year').transform('mean'))

In [15]:
pop_life_fill.to_csv(r'health_pop_3.csv', index = False)

In [19]:
pop_life_fill_2.to_csv(r'health_pop_4.csv', index = False)

In [20]:
file_to_load_trey = pd.read_csv('complete_country_medals_by_year.csv')

medal_count_df = pd.DataFrame(file_to_load_trey)

In [23]:
medal_count = medal_count_df['Country'].replace('Soviet Union', 'Russia', inplace=True)

In [37]:
medal_count = medal_count_df['Country'].replace('Russian Federation', 'Russia', inplace=True)

In [42]:
medal_count = medal_count_df['Country'].replace('Great Britain', 'England', inplace=True)
medal_count = medal_count_df['Country'].replace('East Germany', 'Germany', inplace=True)
medal_count = medal_count_df['Country'].replace('West Germany', 'Germany', inplace=True)

In [43]:
medal_count = medal_count_df['Country'].replace("People's Republic of China", 'China', inplace=True)

In [44]:
medals_health_pop_stats = pd.merge(medal_count_df, pop_life_fill_2, how="left", on=["Country", "Year"])

In [45]:
medals_health_pop_stats.head(20)

,Country,Country Code,Gold,Silver,Bronze,Total,Year,Host_City,Host_Country,COU,Life Expectancy at Birth,Population
0,United States,USA,36,26,28,90,1964,Tokyo,JPN,USA,70.300000,191888791.0
1,Russia,URS,30,31,35,96,1964,Tokyo,JPN,RUS,67.700000,125412625.0
2,Japan,JPN,16,5,8,29,1964,Tokyo,JPN,JPN,70.300000,98110000.0
3,Germany,GER,10,22,18,50,1964,Tokyo,JPN,DEU,70.600000,75318338.0
4,Italy,ITA,10,10,7,27,1964,Tokyo,JPN,NaN,65.312903,51675294.0
5,Hungary,HUN,10,7,5,22,1964,Tokyo,JPN,HUN,69.500000,10119834.0
6,Poland,POL,7,6,10,23,1964,Tokyo,JPN,POL,68.700000,31161200.0
7,Australia,AUS,6,2,10,18,1964,Tokyo,JPN,AUS,70.700000,11121600.0
8,Czechoslovakia,TCH,5,6,3,14,1964,Tokyo,JPN,NaN,NaN,NaN
9,England,GBR,4,12,2,18,1964,Tokyo,JPN,NaN,NaN,NaN
10,Bulgaria,BUL,3,5,2,10,1964,Tokyo,JPN,NaN,65.312903,8144340.0
11,Finland,FIN,3,0,2,5,1964,Tokyo,JPN,NaN,65.312903,4548545.0
12,New Zealand,NZL,3,0,2,5,1964,Tokyo,JPN,NZL,71.200000,2591965.0
13,Romania,ROU,2,4,6,12,1964,Tokyo,JPN,NaN,65.312903,19207135.0
14,Netherlands,NED,2,4,4,10,1964,Tokyo,JPN,NLD,73.800000,12127116.0
15,Turkey,TUR,2,3,1,6,1964,Tokyo,JPN,TUR,51.000000,30391000.0
16,Sweden,SWE,2,2,4,8,1964,Tokyo,JPN,SWE,73.800000,7661351.0
17,Denmark,DEN,2,1,3,6,1964,Tokyo,JPN,NaN,65.312903,4722074.0
18,Yugoslavia,YUG,2,1,2,5,1964,Tokyo,JPN,NaN,NaN,NaN
19,Belgium,BEL,2,0,1,3,1964,Tokyo,JPN,BEL,70.900000,9378114.0

In [46]:
medals_health_pop_stats.to_csv(r'metal_count_stats.csv', index = False)